{
  "semantics": [
    {
      "label": "Modo para im치genes de puerta",
      "description": "Seleccionar si usted quiere configurar cada imagen de puerta personalizada usted mismo o quiere permitir que H5P haga el trabajo por usted bas치ndose en la imagen del fondo del calendario configurada en las configuraciones del comportamiento.",
      "options": [
        {
          "label": "Quiero configurar yo mismo cada imagen de puerta"
        },
        {
          "label": "H5P pondr치 las im치genes de la puerta bas치ndose en la imagen del fondo"
        }
      ]
    },
    {
      "label": "Puertas",
      "entity": "puerta",
      "field": {
        "fields": [
          {
            "label": "Tipo de contenido",
            "description": "Tipo de contenido que opcionalmente saldr치 cuando la puerta sea abierta.",
            "options": [
              {
                "label": "Audio"
              },
              {
                "label": "Imagen"
              },
              {
                "label": "Enlace"
              },
              {
                "label": "Texto"
              },
              {
                "label": "Video"
              }
            ]
          },
          {
            "label": "Audio"
          },
          {
            "label": "Imagen"
          },
          {
            "label": "Enlace"
          },
          {
            "label": "Texto"
          },
          {
            "label": "Video"
          },
          {
            "label": "Autoreproducir"
          },
          {
            "label": "Imagen de puerta",
            "description": "Imagen que ser치 usada para la puerta. Necesita tener una proporci칩n de tama침o 1:1 si quiere que la mitad izquierda encaje con la mitad derecha."
          },
          {
            "label": "Imagen de fondo",
            "description": "Imagen que debe aparecer dentro de la puerta. De forma predeterminada ser치 el n칰mero de la puerta."
          }
        ]
      },
      "widgets": [
        {
          "label": "Predeterminado"
        }
      ]
    },
    {
      "label": "Configuraciones visuales",
      "description": "Estas opciones le permitir치n configurar la apariencia visual.",
      "fields": [
        {
          "label": "Imagen del fondo del calendario"
        },
        {
          "label": "Plantilla de imagen de puerta",
          "description": "Si se configura una imagen, ser치 usada para cada puerta a menos que una imagen de puerta espec칤fica sea configurada para una sola puerta."
        },
        {
          "label": "Ocultar borde de puerta"
        },
        {
          "label": "Ocultar n칰meros de puerta"
        },
        {
          "label": "Ocultar perillas de puerta"
        },
        {
          "label": "Ocultar marco de puerta"
        },
        {
          "label": "Que caiga nieve",
          "description": "A침adir치 ca칤da de nieve al frente del calendario. Nunca llueve en el Sur de California, Nunca cae nieve en IE11."
        }
      ]
    },
    {
      "label": "Configuraciones de audio",
      "description": "Estas opciones le permitir치n configurar la apariencia del audio.",
      "fields": [
        {
          "label": "M칰sica de fondo"
        },
        {
          "label": "Auto-reproducir m칰sica de fondo",
          "description": "Si se activa, la m칰sica de fondo se reproducir치 autom치ticamente una vez que se abra el contenido. Por favor tenga en cuenta: Las pol칤ticas para medios de algunos navegadores podr칤an impedir la auto-reproducci칩n."
        }
      ]
    },
    {
      "label": "Configuraciones del comportamiento",
      "description": "Estas opciones le permitir치n cambiar las configuraciones del comportamiento.",
      "fields": [
        {
          "label": "Modo para colocaci칩n de puerta",
          "description": "Seleccionar si es que usted quiere configurar un n칰mero fijo de columnas y filas para las puertas o si H5P deber칤a decidir din치micamente dependiendo del espacio disponible. Tenga en cuenta que esto 칰ltimo podr칤a interferir con la posici칩n de la imagen del fondo y con im치genes que cubren la puerta personalizada las cuales deber칤an estar en una posici칩n particular.",
          "options": [
            {
              "label": "Fija"
            },
            {
              "label": "Din치mica"
            }
          ]
        },
        {
          "label": "Proporci칩n fila-a-columna",
          "description": "Seleccionar cuantas columnas y filas deber칤a usar el calendario.",
          "options": [
            {
              "label": "6 칑 4"
            },
            {
              "label": "4 칑 6"
            }
          ]
        },
        {
          "label": "Orden aleatorio",
          "description": "Barajear el orden de las puertas. Si la opci칩n \"guardar estado del contenido\" est치 activada en las configuraciones de H5P, ese orden se conservar치 igual cuando el usuario regrese despu칠s."
        },
        {
          "label": "Conservar orden de im치genes",
          "description": "Barajear puertas, pero conservar las im치genes de cubierta de puertas en sus posiciones fijas comenzando con 1 en la esquina superior izquierda hasta 24 en la esquina inferior derecha."
        },
        {
          "label": "Modo dise침ador",
          "description": "En modo dise침ador, todas las puertas pueden abrirse. En caso contrario, las puertas solamente pueden abrirse en diciembre y despu칠s de la fecha respectiva indicada por el n칰mero de la puerta."
        }
      ]
    },
    {
      "label": "Localizaci칩n",
      "fields": [
        {
          "label": "Nada para ver",
          "default": "춰Aqu칤 no hay nada para ver!游꾻"
        },
        {
          "label": "Dummy",
          "default": "Dummy"
        }
      ]
    },
    {
      "label": "Accesibilidad",
      "fields": [
        {
          "label": "Puerta",
          "default": "Puerta"
        },
        {
          "label": "Cerrada",
          "default": "Cerrada. Aun no es hora de abrir esta."
        },
        {
          "description": "Anunciar el contenido. @door es una variable y ser치 remplazada con la descripci칩n de la puerta relacionada.",
          "label": "Contenido de",
          "default": "Contenido de @door"
        },
        {
          "label": "Enmudecer audio",
          "default": "Enmudecer audio"
        },
        {
          "label": "Activar audio",
          "default": "Activar audio"
        },
        {
          "label": "Cerrar ventana",
          "default": "Cerrar ventana"
        }
      ]
    }
  ]
}
